app/views/users/show.html.haml

SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]
---
        = photo.created_at
      - photo.tags.each do |tag|