app/views/users/show.html.haml

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
---
        %h1{:id => "caption"}
          = link.photos[link.photos.length-1].title
        - if @user.id != link.photos[link.photos.length-1].user_id