app/controllers/photos_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "photos" SET "user_id" = ?, "title" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["user_id", 1], ["title", "ASDDDDDDDDDDDDDDDDDDDDDDD"], ["updated_at", "2022-11-17 17:42:54.197362"], ["id", 24]]
---
  def create
    @user = User.find(params[:user_id])
    if params[:photo]["image"] == nil
      flash[:alert] = "Please upload a photo"
      redirect_to :back
    else
      if params[:photo]["title"] == ""
        params[:photo]["title"] = "Default title"
      end
      @photo = Photo.create(photo_params)
      @photo.user_id = @user.id
      @photo.title = params[:photo]["title"]
      @photo.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-11-15 17:41:49.097455"], ["updated_at", "2022-11-15 17:41:49.097455"]]
---
  def new
    @user = User.find(params[:user_id])
    @photo = Photo.create()