app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.valid?
    if !@user.is_email?
      flash[:alert] = "Input a properly formatted email."
      redirect_to :back
    elsif @user.errors.messages[:email] != nil
      flash[:notice]= "That email " + @user.errors.messages[:email].first
      redirect_to :back
    elsif @user.save
---
INSERT INTO "users" ("email", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @users = User.all
    @user = User.find(params[:id])
    @links = [@user]
    Follow.where(follower: params[:id]).each do |follow|
      @links << User.find(follow[:followee])
    end
    @photos = []
    @links.each do |link|
      link.photos.each do |photo|
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]